MikroElektronika/core_packages/ARM/gcc_clang/def/silabs/EFR32FG23A010F512GM48/mcu.h
/* Include standard ARM headers for the core */
// #include "core_cm33.h"        /* Core Header File */  // Note: Changed for MikroE implementation.
// #include "system_efr32fg23.h" /* System Header File */  // Note: Changed for MikroE implementation.
#include <stdint.h>
#define     __I     volatile const       /*!< Defines 'read only' permissions */
#define     __O     volatile             /*!< Defines 'write only' permissions */
#define     __IO    volatile             /*!< Defines 'read / write' permissions */

/* following defines should be used for structure members */
#define     __IM     volatile const      /*! Defines 'read only' structure member permissions */
#define     __OM     volatile            /*! Defines 'write only' structure member permissions */
#define     __IOM    volatile            /*! Defines 'read / write' structure member permissions */

typedef struct {
  __IOM uint32_t CTRL; /**< Channel Control Register  */
} PRS_CH_TypeDef;

typedef struct {
  __IOM uint32_t CTRL; /**< Channel Control Register  */
} DMA_CH_TypeDef;

typedef struct {
  __IOM uint32_t CFG;                                /**< Configuration                                      */
  __IOM uint32_t LOOP;                               /**< Loop Counter                                       */
  __IOM uint32_t CTRL;                               /**< Control                                            */
  __IOM uint32_t SRC;                                /**< Source Address                                     */
  __IOM uint32_t DST;                                /**< Destination Address                                */
  __IOM uint32_t LINK;                               /**< Link Address                                       */
  __IOM uint32_t XCTRL;                              /**< Extended Control                                   */
  uint32_t       RESERVED0[1U];                      /**< Reserved for future use                            */
  __IOM uint32_t ILSRC;                              /**< Interleaving Source Address                        */
  uint32_t       RESERVED1[3U];                      /**< Reserved for future use                            */
} LDMA_CH_TypeDef;

/** @} End of group EFR32FG23A010F512GM48_Part */

/**************************************************************************//**
 * @defgroup EFR32FG23A010F512GM48_Peripheral_TypeDefs EFR32FG23A010F512GM48 Peripheral TypeDefs
 * @{
 * @brief Device Specific Peripheral Register Structures
 *****************************************************************************/
// #include "efr32fg23_scratchpad.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_emu.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_cmu.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_hfrco.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_fsrco.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_dpll.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_lfxo.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_lfrco.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_ulfrco.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_msc.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_icache.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_prs.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_gpio.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_ldma.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_ldmaxbar.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_timer.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_usart.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_burtc.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_i2c.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_syscfg.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_buram.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_gpcrc.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_dcdc.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_mailbox.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_eusart.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_sysrtc.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_lcd.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_keyscan.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_mpahbram.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_lcdrf.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_pfmxpprf.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_aes.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_smu.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_letimer.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_iadc.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_acmp.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_vdac.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_pcnt.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_lesense.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_hfxo.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_wdog.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_semailbox.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_devinfo.h"  // Note: Changed for MikroE implementation.

/* Custom headers for LDMAXBAR and PRS mappings */
// #include "efr32fg23_prs_signals.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_dma_descriptor.h"  // Note: Changed for MikroE implementation.
// #include "efr32fg23_ldmaxbar_defines.h"  // Note: Changed for MikroE implementation.

